In [3]:
import numpy as np
import pandas as pd

#pandas的基礎操作
#使用reindex()利用重新建立索引產生新的資料集
obj=pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [4]:
obj.reindex(['a', 'c', 'd', 'e'])

a   -5.3
c    3.6
d    4.5
e    NaN
dtype: float64

In [10]:
#dataFrame也有reindex()
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                    index=['a', 'c', 'd'],
                    columns=['台北', '台中', '高雄'])
frame.reindex(['a','d','c'])

   台北  台中  高雄
a   0   1   2
d   6   7   8
c   3   4   5

In [11]:
frame.reindex(['a', 'd'])

   台北  台中  高雄
a   0   1   2
d   6   7   8

In [12]:
frame

   台北  台中  高雄
a   0   1   2
c   3   4   5
d   6   7   8

In [14]:
frame.reindex(columns=['台北','台中'])

   台北  台中
a   0   1
c   3   4
d   6   7

In [15]:
#使用drop()移除欄或列
obj = pd.Series(np.arange(5.),index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [16]:
#使用drop()方法移除一個列索引
obj.drop('c')

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [17]:
obj.drop(['c','d'])

a    0.0
b    1.0
e    4.0
dtype: float64

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [19]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index=['台北','台中', '台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [20]:
data.drop('台北')

    one  two  three  four
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [21]:
data.drop(['台北','台南'])

    one  two  three  four
台中    4    5      6     7
高雄   12   13     14    15

In [22]:
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [24]:
#使用引數名稱axis=1或axis='columns'移除欄
data.drop('one', axis='columns')

    two  three  four
台北    1      2     3
台中    5      6     7
台南    9     10    11
高雄   13     14    15

In [25]:
#索引、選取、過濾
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [26]:
obj['a']

0.0

In [27]:
obj['a':'c']

a    0.0
b    1.0
c    2.0
dtype: float64

In [28]:
obj[0:2]

a    0.0
b    1.0
dtype: float64

In [30]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['台北','台中','台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [32]:
data[['one','two']]

    one  two
台北    0    1
台中    4    5
台南    8    9
高雄   12   13

In [33]:
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [34]:
data['台北':'台中']

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7

In [36]:
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [37]:
data[:2]

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7

In [38]:
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [43]:
data['two'] < 5

台北     True
台中    False
台南    False
高雄    False
Name: two, dtype: bool

In [46]:
data[data<5] = 0
data

    one  two  three  four
台北    0    0      0     0
台中    0    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [47]:
#使用loc,iloc選取
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['台北','台中','台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [48]:
data.loc['台北','one']

0

In [50]:
data.loc['台北','one':'three']

one      0
two      1
three    2
Name: 台北, dtype: int64

In [51]:
data.loc['台北',['one', 'two', 'four']]

one     0
two     1
four    3
Name: 台北, dtype: int64

In [52]:
data.loc['台北':'台中', 'two':'four']

    two  three  four
台北    1      2     3
台中    5      6     7

In [53]:
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [54]:
data.iloc[0, 1]

1

In [55]:
data.iloc[:,:2]

    one  two
台北    0    1
台中    4    5
台南    8    9
高雄   12   13

In [60]:
import csv
with open('各鄉鎮市區人口密度.csv','r',encoding='utf-8') as file:
    reader = csv.reader(file)
    dataList=list(reader)
dataFrame = pd.DataFrame(dataList)
dataFrame=dataFrame.drop(0)
dataFrame

,0,1,2,3,4
1,統計年,區域別,年底人口數,土地面積,人口密度
2,106,新北市板橋區,551480,23.1373,23835
3,106,新北市三重區,387484,16.317,23747
4,106,新北市中和區,413590,20.144,20532
5,106,新北市永和區,222585,5.7138,38956
...,...,...,...,...,...
372,,,,,
373,,說明：1.人口密度係指每單位土地面積內之人口數。,,,
374,,2.96年12月起，我國土地面積增列東沙群島(2.38平方公里)及南沙群島(0.4896平方公里),,,
375,,，由高雄市代管；原金門縣烏坵鄉面積，因重測由2.6平方公里修正為1.2平方公里。,,,
376,,3.104年12月南沙太平島交通基礎整建工程竣工，增加面積0.0149平方公里。,,,